In [46]:
import pandas as pd
data = pd.read_csv("../data/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
features = ["Survived", "Pclass", "Age", "Fare", "SibSp", "Parch"]
data_features = data[features]
data_features.head()

   Survived  Pclass   Age     Fare  SibSp  Parch
0         0       3  22.0   7.2500      1      0
1         1       1  38.0  71.2833      1      0
2         1       3  26.0   7.9250      0      0
3         1       1  35.0  53.1000      1      0
4         0       3  35.0   8.0500      0      0

In [48]:
features = data_features.drop("Survived", axis=1)
labels = data_features["Survived"]
features.head()

   Pclass   Age     Fare  SibSp  Parch
0       3  22.0   7.2500      1      0
1       1  38.0  71.2833      1      0
2       3  26.0   7.9250      0      0
3       1  35.0  53.1000      1      0
4       3  35.0   8.0500      0      0

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(features, labels, test_size=0.2, random_state=0)
print("Trainingsdatenpunkte: ", len(X_train))
print("Testdatenpunkte: ", len(X_test))

Trainingsdatenpunkte:  712
Testdatenpunkte:  179

In [50]:
X_train.head()

     Pclass   Age     Fare  SibSp  Parch
140       3   NaN  15.2458      0      2
439       2  31.0  10.5000      0      0
817       2  31.0  37.0042      1      1
378       3  20.0   4.0125      0      0
491       3  21.0   7.2500      0      0

In [51]:
X_train.isna().sum()

Pclass      0
Age       141
Fare        0
SibSp       0
Parch       0
dtype: int64

In [52]:
X_train["Age"] = X_train["Age"].fillna(X_train["Age"].mean())

In [53]:
print(X_train["Age"].mean())

29.745183887915932

In [54]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler().fit(X_train)
X_scaled = scaler.transform(X_train)
X_scaled

array([[ 0.81925059,  0.        , -0.33167904, -0.46445234,  1.95926403],
       [-0.38096838,  0.09593203, -0.42640542, -0.46445234, -0.47741019],
       [-0.38096838,  0.09593203,  0.10261958,  0.41270964,  0.74092692],
       ...,
       [ 0.81925059,  0.        , -0.48162887, -0.46445234, -0.47741019],
       [ 0.81925059,  0.47818735, -0.28868112,  0.41270964, -0.47741019],
       [-0.38096838,  2.31301288,  0.14245584,  0.41270964,  0.74092692]])

In [55]:
from sklearn.linear_model import LogisticRegression
logisticRegr = LogisticRegression(max_iter=1000) # Gradient Descent mit max. 1000 Schritten
logisticRegr.fit(X_scaled, y_train)

LogisticRegression(max_iter=1000)